# GetDocumentPreviewSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..GetDocumentPreviewSettings Method
Document Class See Also
---
Returns the preview settings for the given document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DocumentPreviewSettings GetDocumentPreviewSettings()
```

Visual Basic
---
```text
Public Function GetDocumentPreviewSettings As DocumentPreviewSettings
```

Visual C++
---
```text
public:
DocumentPreviewSettings^ GetDocumentPreviewSettings()
```

# ### Return Value
The preview settings.
# See Also
Document Class
Autodesk.Revit.DB Namespace